================================================================================
numeric variable with type constraint
================================================================================
var x integer;
--------------------------------------------------------------------------------

(model
  (var
    (model_object)
    (attribute)))

================================================================================
numeric variable with numeric constraint
================================================================================
var x >= 0;
--------------------------------------------------------------------------------

(model
  (var
    (model_object)
    (attribute
      (expr
        (number)))))

================================================================================
variable with indexing expressions
================================================================================
var y{I,J};
--------------------------------------------------------------------------------

(model
  (var
    (model_object)
    (indexing_expression
      (indexing_entry
        (expr
          (symbolic_name)))
      (indexing_entry
        (expr
          (symbolic_name))))))

================================================================================
variable with indexing expression and multiple attributes
================================================================================
var make{p in prd}, integer, >= commit[p], <= market[p];
--------------------------------------------------------------------------------

(model
  (var
    (model_object)
    (indexing_expression
      (indexing_entry
        (symbolic_name)
        (operator)
        (expr
          (symbolic_name))))
    (attribute)
    (attribute
      (expr
        (symbolic_name)
        (subscript
          (expr
            (symbolic_name)))))
    (attribute
      (expr
        (symbolic_name)
        (subscript
          (expr
            (symbolic_name)))))))

================================================================================
variable with indexing expression using range
================================================================================
var store{raw, 1..T+1} >= 0;
--------------------------------------------------------------------------------

(model
  (var
    (model_object)
    (indexing_expression
      (indexing_entry
        (expr
          (symbolic_name)))
      (indexing_entry
        (expr
          (expr
            (number))
          (operator)
          (expr
            (expr
              (symbolic_name))
            (operator)
            (expr
              (number))))))
    (attribute
      (expr
        (number)))))

================================================================================
variable with indexing expression
================================================================================
var A{i in 1..T};
--------------------------------------------------------------------------------

(model
  (var
    (model_object)
    (indexing_expression
      (indexing_entry
        (symbolic_name)
        (operator)
        (expr
          (expr
            (number))
          (operator)
          (expr
            (symbolic_name)))))))

================================================================================
variable with spaced indexing expression
================================================================================
var A{i in 1 .. T};
--------------------------------------------------------------------------------

(model
  (var
    (model_object)
    (indexing_expression
      (indexing_entry
        (symbolic_name)
        (operator)
        (expr
          (expr
            (number))
          (operator)
          (expr
            (symbolic_name)))))))

================================================================================
variable with indexing expression using a float
================================================================================
var A{i in 1 .. T};
--------------------------------------------------------------------------------

(model
  (var
    (model_object)
    (indexing_expression
      (indexing_entry
        (symbolic_name)
        (operator)
        (expr
          (expr
            (number))
          (operator)
          (expr
            (symbolic_name)))))))

================================================================================
variable with indexing expression using a spaced float
================================================================================
var A{i in 1. ..T};
--------------------------------------------------------------------------------

(model
  (var
    (model_object)
    (indexing_expression
      (indexing_entry
        (symbolic_name)
        (operator)
        (expr
          (expr
            (number))
          (operator)
          (expr
            (symbolic_name)))))))

================================================================================
variable with indexing expression and bound
================================================================================
var z{i in I, j in J} >= i+j;
--------------------------------------------------------------------------------

(model
  (var
    (model_object)
    (indexing_expression
      (indexing_entry
        (symbolic_name)
        (operator)
        (expr
          (symbolic_name)))
      (indexing_entry
        (symbolic_name)
        (operator)
        (expr
          (symbolic_name))))
    (attribute
      (expr
        (expr
          (symbolic_name))
        (operator)
        (expr
          (symbolic_name))))))
